printanastasia)
1)anastasia=khvedelidze
#როგორც ვიცით visual studio code კითხულობს ყველაფერს ხაზ ხაზ ამიტომ ჯერ უნდა შევქმნათ ცვლადი anastasia რომ შემდეგ davprintot და არ მივიღოთ error

1anastasia)
#აქ მივიღეთ error რადგან როდესაც ტექსტობრივ რამეს ვწერთ ხოველთვის უნდა ბრჭყალები.

1)anastasia="(12"
#როდესაც ვიყენებთ რიცხვს არ სჭირდება ბრჭყალები. მხოლოდ ტექსტობრივ რაღაცეებში ვიყენებთ ბრჭყალებს.

1print 10 x 10=100
#პროგრამისტობაში გამრავლებისთვის ვიყენებთ * ხოლო მათემატიკაში x.

1age=12
#როდესაც ცვლადს ვქმნით წინ არ შეიძლება რიცხვის დაწერა.

1printanastasia
#print-ის მერე ყოველთვის უნდა დავწეროთ ბრჩხილები.

1day 16
#ცვლადს წინ არ სჭირდება წინ ისარი და როდესაც ცვლადს ვქმნით ყოველთვის უნდა დავუწეროთ ტოლობის ნიშანი. 

1my age=12
#my age-ს შორის არ უნდა იყოს გამოტოვება.