#1 რა არის პითონი პროგრამირებაში?
#1 პითონი პროგრამირებაში პროგრამირების ენაა 

#2 რა არის turtle-ი python-ში?
#2 library

#3 რას გამოიტანს ეს კოდი ტერმინალში print('heloo world')
#3 ეს გამოიტანს heloo world-ს 

#4 რას გამოიტანს ეს კოდი ტერმინალში? print(true > false)
#4 ეს გამოიტსანს true-ს 

#5 რითი ვქმნით კომენტარეს python-ში?
#5 python-ში კომენტარებს #-ამის დახმარებით ვქმნით

#6 რას გამოიტანს ეს კოდი ტერმინალში? x=15 y=4 print(x // y)
#6 ეს გამოიტანს 3-ს

#7 რას გამოიტანს ეს კოდი ტერმინალში? x=10 y=4 print(x / y)
#7 ეს გამოიტანს 2.5-ს

#8 რას გამოიტანს ეს კოდი ტერმინალში? x=10 y="20" print(x + y)
#8 ეს გამოიტანს eror-ს

#9 რას გამოიტანს ეს კოდი ტერმინალში? x=5 y=2 print(x ** y)
#9 ეს გამოიტანს 25-ს

#10 if მუშაობს  else-ის გარეშე
#10 true 

#11 რითი მთავრდება foor loop?
#11 for loop-ი მთავრდება break-ით

#12 რა იქნება თუ 10 % 3?
#12 1

#13 integer-ი მთავრდება string-ზე
#13 true 

#14 რას გამოიტანს ეს კოდი ტერმინალში print(3>4 or 3<5 and 500 < 400 or 320 > 244)
#14 true

#15 რა არის სია list?
#15 array

#16 რა არის ალგორითმი?
#16 მოქმედენის ნაბიჯ-ნაბიჯ შესრულება

#17 პითონი გველია თუ კუდი?
#17 კუდი

#18 დავიდი უსმენს როკის სტილის მუსიკას
#18 true

#19 ბატონი გაბრიელი არ უსმენს ქართულ მამა პაპურ მუსიკებს
#19 false

#20 გაკვეტილი ჩატარდა კანფეტივით
#20 true 

#21 რომელი ხინკალი ჯობია
#21 ფასანაურული 